Revit 2024 API
Revolution.Axis Property
Returns the Axis of the Revolution.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public ModelLine Axis { get; }
Visual Basic
Public ReadOnly Property Axis As ModelLine
	Get
Visual C++
public:
property ModelLine^ Axis {
	ModelLine^ get ();
}
Remarks
This property is used to retrieve the Axis of the Revolution.
See Also
Revolution Class
Autodesk.Revit.DB Namespace